app/views/users/show.html.erb


<% if @user.microposts.any? %>
---
SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]