app/controllers/application_controller.rb

    def current_user#ログイン系は全部ifでcurrent_userを使って条件分岐
        @current_user ||= begin
          if cookies.signed[:user_data]
            user_data = cookies.signed[:user_data]
            User.find_by(slug: user_data["slug"])
---
SELECT "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT $2  [["slug", "test_user"], ["LIMIT", 1]]