app/controllers/drafts_controller.rb

  def index
    @user = User.find_by(slug: params[:slug])
---
SELECT "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT $2  [["slug", "test_user"], ["LIMIT", 1]]