app/controllers/microposts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT $2  [["slug", "test_user"], ["LIMIT", 1]]
---
    def zen_new
      @user = User.find_by(slug: params[:slug])

SELECT "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT $2  [["slug", "test_user"], ["LIMIT", 1]]
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "status", "guest_email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "<p>test</p>"], ["user_id", 1], ["created_at", "2025-02-17 09:31:21.290050"], ["updated_at", "2025-02-17 09:31:21.290050"], ["status", 1], ["guest_email", "wadakazumaa@gmail.com"]]
---
    def zen_create
      puts "reach to zen_create✅"
      # fixed_params = { micropost: { content: params[:content] } }
      # params.merge!(fixed_params)
      Rails.logger.debug "🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️🛠️Params: #{params.inspect}" # パラメータの中身をログに表示

      @user = User.find_by(slug: params[:slug])
      #has_manyを扱っているから複数形
      @micropost = @user.microposts.build(micropost_params)

      if params[:draft]
        @micropost.status = 'draft'
      else
        @micropost.status = 'published'
        puts @micropost.content + "🎨🎨🎨🎨🎨🎨🎨🎨"
      end

      if @micropost.save && @micropost.status == "published"