app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "kazuma"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(name: session_params[:name])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_digest", "admin", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
---
  def guest
    user = User.find_or_create_by!(email: 'test@gmail.com') do |user|