app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT $2  [["slug", "test_user"], ["LIMIT", 1]]
---
  def camera
    @user = User.find_by(slug: params[:slug])

SELECT "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT $2  [["slug", "test_user"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(slug: params[:slug])